MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx675f256l.h
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF8861B0)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF8861B4)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF8861B8)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF8861BC)));
#define CNCON CNCON
extern volatile uint32_t   CNCON __attribute__((section("sfrs"), address(0xBF8861C0)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONbits_t;
extern volatile __CNCONbits_t CNCONbits __asm__ ("CNCON") __attribute__((section("sfrs"), address(0xBF8861C0)));
extern volatile uint32_t        CNCONCLR __attribute__((section("sfrs"),address(0xBF8861C4)));
extern volatile uint32_t        CNCONSET __attribute__((section("sfrs"),address(0xBF8861C8)));
extern volatile uint32_t        CNCONINV __attribute__((section("sfrs"),address(0xBF8861CC)));
#define CNEN CNEN
extern volatile uint32_t   CNEN __attribute__((section("sfrs"), address(0xBF8861D0)));
typedef union {
  struct {
    uint32_t CNEN0:1;
    uint32_t CNEN1:1;
    uint32_t CNEN2:1;
    uint32_t CNEN3:1;
    uint32_t CNEN4:1;
    uint32_t CNEN5:1;
    uint32_t CNEN6:1;
    uint32_t CNEN7:1;
    uint32_t CNEN8:1;
    uint32_t CNEN9:1;
    uint32_t CNEN10:1;
    uint32_t CNEN11:1;
    uint32_t CNEN12:1;
    uint32_t CNEN13:1;
    uint32_t CNEN14:1;
    uint32_t CNEN15:1;
    uint32_t CNEN16:1;
    uint32_t CNEN17:1;
    uint32_t CNEN18:1;
    uint32_t CNEN19:1;
    uint32_t CNEN20:1;
    uint32_t CNEN21:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENbits_t;
extern volatile __CNENbits_t CNENbits __asm__ ("CNEN") __attribute__((section("sfrs"), address(0xBF8861D0)));
extern volatile uint32_t        CNENCLR __attribute__((section("sfrs"),address(0xBF8861D4)));
extern volatile uint32_t        CNENSET __attribute__((section("sfrs"),address(0xBF8861D8)));
extern volatile uint32_t        CNENINV __attribute__((section("sfrs"),address(0xBF8861DC)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF8861E0)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t CNPUE2:1;
    uint32_t CNPUE3:1;
    uint32_t CNPUE4:1;
    uint32_t CNPUE5:1;
    uint32_t CNPUE6:1;
    uint32_t CNPUE7:1;
    uint32_t CNPUE8:1;
    uint32_t CNPUE9:1;
    uint32_t CNPUE10:1;
    uint32_t CNPUE11:1;
    uint32_t CNPUE12:1;
    uint32_t CNPUE13:1;
    uint32_t CNPUE14:1;
    uint32_t CNPUE15:1;
    uint32_t CNPUE16:1;
    uint32_t CNPUE17:1;
    uint32_t CNPUE18:1;
    uint32_t CNPUE19:1;
    uint32_t CNPUE20:1;
    uint32_t CNPUE21:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF8861E0)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF8861E4)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF8861E8)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF8861EC)));
#define ETHCON1 ETHCON1
extern volatile uint32_t   ETHCON1 __attribute__((section("sfrs"), address(0xBF889000)));
typedef union {
  struct {
    uint32_t BUFCDEC:1;
    uint32_t :3;
    uint32_t MANFC:1;
    uint32_t :2;
    uint32_t AUTOFC:1;
    uint32_t RXEN:1;
    uint32_t TXRTS:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t PTV:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs"), address(0xBF889000)));
extern volatile uint32_t        ETHCON1CLR __attribute__((section("sfrs"),address(0xBF889004)));
extern volatile uint32_t        ETHCON1SET __attribute__((section("sfrs"),address(0xBF889008)));
extern volatile uint32_t        ETHCON1INV __attribute__((section("sfrs"),address(0xBF88900C)));
#define ETHCON2 ETHCON2
extern volatile uint32_t   ETHCON2 __attribute__((section("sfrs"), address(0xBF889010)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t RXBUF_SZ:7;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs"), address(0xBF889010)));
extern volatile uint32_t        ETHCON2CLR __attribute__((section("sfrs"),address(0xBF889014)));
extern volatile uint32_t        ETHCON2SET __attribute__((section("sfrs"),address(0xBF889018)));
extern volatile uint32_t        ETHCON2INV __attribute__((section("sfrs"),address(0xBF88901C)));
#define ETHTXST ETHTXST
extern volatile uint32_t   ETHTXST __attribute__((section("sfrs"), address(0xBF889020)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs"), address(0xBF889020)));
extern volatile uint32_t        ETHTXSTCLR __attribute__((section("sfrs"),address(0xBF889024)));
extern volatile uint32_t        ETHTXSTSET __attribute__((section("sfrs"),address(0xBF889028)));
extern volatile uint32_t        ETHTXSTINV __attribute__((section("sfrs"),address(0xBF88902C)));
#define ETHRXST ETHRXST
extern volatile uint32_t   ETHRXST __attribute__((section("sfrs"), address(0xBF889030)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs"), address(0xBF889030)));
extern volatile uint32_t        ETHRXSTCLR __attribute__((section("sfrs"),address(0xBF889034)));
extern volatile uint32_t        ETHRXSTSET __attribute__((section("sfrs"),address(0xBF889038)));
extern volatile uint32_t        ETHRXSTINV __attribute__((section("sfrs"),address(0xBF88903C)));
#define ETHHT0 ETHHT0
extern volatile uint32_t   ETHHT0 __attribute__((section("sfrs"), address(0xBF889040)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTLOWER:32;
  };
} __ETHHT0bits_t;
extern volatile __ETHHT0bits_t ETHHT0bits __asm__ ("ETHHT0") __attribute__((section("sfrs"), address(0xBF889040)));
extern volatile uint32_t        ETHHT0CLR __attribute__((section("sfrs"),address(0xBF889044)));
extern volatile uint32_t        ETHHT0SET __attribute__((section("sfrs"),address(0xBF889048)));
extern volatile uint32_t        ETHHT0INV __attribute__((section("sfrs"),address(0xBF88904C)));
#define ETHHT1 ETHHT1
extern volatile uint32_t   ETHHT1 __attribute__((section("sfrs"), address(0xBF889050)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTUPPER:32;
  };
} __ETHHT1bits_t;
