MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx675f256l.h
extern volatile __ETHHT1bits_t ETHHT1bits __asm__ ("ETHHT1") __attribute__((section("sfrs"), address(0xBF889050)));
extern volatile uint32_t        ETHHT1CLR __attribute__((section("sfrs"),address(0xBF889054)));
extern volatile uint32_t        ETHHT1SET __attribute__((section("sfrs"),address(0xBF889058)));
extern volatile uint32_t        ETHHT1INV __attribute__((section("sfrs"),address(0xBF88905C)));
#define ETHPMM0 ETHPMM0
extern volatile uint32_t   ETHPMM0 __attribute__((section("sfrs"), address(0xBF889060)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMLOWER:32;
  };
} __ETHPMM0bits_t;
extern volatile __ETHPMM0bits_t ETHPMM0bits __asm__ ("ETHPMM0") __attribute__((section("sfrs"), address(0xBF889060)));
extern volatile uint32_t        ETHPMM0CLR __attribute__((section("sfrs"),address(0xBF889064)));
extern volatile uint32_t        ETHPMM0SET __attribute__((section("sfrs"),address(0xBF889068)));
extern volatile uint32_t        ETHPMM0INV __attribute__((section("sfrs"),address(0xBF88906C)));
#define ETHPMM1 ETHPMM1
extern volatile uint32_t   ETHPMM1 __attribute__((section("sfrs"), address(0xBF889070)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMUPPER:32;
  };
} __ETHPMM1bits_t;
extern volatile __ETHPMM1bits_t ETHPMM1bits __asm__ ("ETHPMM1") __attribute__((section("sfrs"), address(0xBF889070)));
extern volatile uint32_t        ETHPMM1CLR __attribute__((section("sfrs"),address(0xBF889074)));
extern volatile uint32_t        ETHPMM1SET __attribute__((section("sfrs"),address(0xBF889078)));
extern volatile uint32_t        ETHPMM1INV __attribute__((section("sfrs"),address(0xBF88907C)));
#define ETHPMCS ETHPMCS
extern volatile uint32_t   ETHPMCS __attribute__((section("sfrs"), address(0xBF889080)));
typedef union {
  struct {
    uint32_t PMCS:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMCSbits_t;
extern volatile __ETHPMCSbits_t ETHPMCSbits __asm__ ("ETHPMCS") __attribute__((section("sfrs"), address(0xBF889080)));
extern volatile uint32_t        ETHPMCSCLR __attribute__((section("sfrs"),address(0xBF889084)));
extern volatile uint32_t        ETHPMCSSET __attribute__((section("sfrs"),address(0xBF889088)));
extern volatile uint32_t        ETHPMCSINV __attribute__((section("sfrs"),address(0xBF88908C)));
#define ETHPMO ETHPMO
extern volatile uint32_t   ETHPMO __attribute__((section("sfrs"), address(0xBF889090)));
typedef union {
  struct {
    uint32_t PMO:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMObits_t;
extern volatile __ETHPMObits_t ETHPMObits __asm__ ("ETHPMO") __attribute__((section("sfrs"), address(0xBF889090)));
extern volatile uint32_t        ETHPMOCLR __attribute__((section("sfrs"),address(0xBF889094)));
extern volatile uint32_t        ETHPMOSET __attribute__((section("sfrs"),address(0xBF889098)));
extern volatile uint32_t        ETHPMOINV __attribute__((section("sfrs"),address(0xBF88909C)));
#define ETHRXFC ETHRXFC
extern volatile uint32_t   ETHRXFC __attribute__((section("sfrs"), address(0xBF8890A0)));
typedef union {
  struct {
    uint32_t BCEN:1;
    uint32_t MCEN:1;
    uint32_t NOTMEEN:1;
    uint32_t UCEN:1;
    uint32_t RUNTEN:1;
    uint32_t RUNTERREN:1;
    uint32_t CRCOKEN:1;
    uint32_t CRCERREN:1;
    uint32_t PMMODE:4;
    uint32_t NOTPM:1;
    uint32_t :1;
    uint32_t MPEN:1;
    uint32_t HTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXFCbits_t;
extern volatile __ETHRXFCbits_t ETHRXFCbits __asm__ ("ETHRXFC") __attribute__((section("sfrs"), address(0xBF8890A0)));
extern volatile uint32_t        ETHRXFCCLR __attribute__((section("sfrs"),address(0xBF8890A4)));
extern volatile uint32_t        ETHRXFCSET __attribute__((section("sfrs"),address(0xBF8890A8)));
extern volatile uint32_t        ETHRXFCINV __attribute__((section("sfrs"),address(0xBF8890AC)));
#define ETHRXWM ETHRXWM
extern volatile uint32_t   ETHRXWM __attribute__((section("sfrs"), address(0xBF8890B0)));
typedef union {
  struct {
    uint32_t RXEWM:8;
    uint32_t :8;
    uint32_t RXFWM:8;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXWMbits_t;
extern volatile __ETHRXWMbits_t ETHRXWMbits __asm__ ("ETHRXWM") __attribute__((section("sfrs"), address(0xBF8890B0)));
extern volatile uint32_t        ETHRXWMCLR __attribute__((section("sfrs"),address(0xBF8890B4)));
extern volatile uint32_t        ETHRXWMSET __attribute__((section("sfrs"),address(0xBF8890B8)));
extern volatile uint32_t        ETHRXWMINV __attribute__((section("sfrs"),address(0xBF8890BC)));
#define ETHIEN ETHIEN
extern volatile uint32_t   ETHIEN __attribute__((section("sfrs"), address(0xBF8890C0)));
typedef union {
  struct {
    uint32_t RXOVFLWIE:1;
    uint32_t RXBUFNAIE:1;
    uint32_t TXABORTIE:1;
    uint32_t TXDONEIE:1;
    uint32_t :1;
    uint32_t RXACTIE:1;
    uint32_t PKTPENDIE:1;
    uint32_t RXDONEIE:1;
    uint32_t FWMARKIE:1;
    uint32_t EWMARKIE:1;
    uint32_t :3;
    uint32_t RXBUSEIE:1;
    uint32_t TXBUSEIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIENbits_t;
extern volatile __ETHIENbits_t ETHIENbits __asm__ ("ETHIEN") __attribute__((section("sfrs"), address(0xBF8890C0)));
extern volatile uint32_t        ETHIENCLR __attribute__((section("sfrs"),address(0xBF8890C4)));
extern volatile uint32_t        ETHIENSET __attribute__((section("sfrs"),address(0xBF8890C8)));
extern volatile uint32_t        ETHIENINV __attribute__((section("sfrs"),address(0xBF8890CC)));
#define ETHIRQ ETHIRQ
extern volatile uint32_t   ETHIRQ __attribute__((section("sfrs"), address(0xBF8890D0)));
typedef union {
  struct {
    uint32_t RXOVFLW:1;
    uint32_t RXBUFNA:1;
    uint32_t TXABORT:1;
    uint32_t TXDONE:1;
    uint32_t :1;
    uint32_t RXACT:1;
    uint32_t PKTPEND:1;
    uint32_t RXDONE:1;
    uint32_t FWMARK:1;
    uint32_t EWMARK:1;
    uint32_t :3;
    uint32_t RXBUSE:1;
    uint32_t TXBUSE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIRQbits_t;
extern volatile __ETHIRQbits_t ETHIRQbits __asm__ ("ETHIRQ") __attribute__((section("sfrs"), address(0xBF8890D0)));
extern volatile uint32_t        ETHIRQCLR __attribute__((section("sfrs"),address(0xBF8890D4)));
extern volatile uint32_t        ETHIRQSET __attribute__((section("sfrs"),address(0xBF8890D8)));
extern volatile uint32_t        ETHIRQINV __attribute__((section("sfrs"),address(0xBF8890DC)));
#define ETHSTAT ETHSTAT
extern volatile uint32_t   ETHSTAT __attribute__((section("sfrs"), address(0xBF8890E0)));
typedef union {
  struct {
    uint32_t :5;
    uint32_t RXBUSY:1;
    uint32_t TXBUSY:1;
    uint32_t BUSY:1;
    uint32_t :8;
    uint32_t BUFCNT:8;
  };
  struct {
    uint32_t :7;
    uint32_t ETHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHSTATbits_t;
extern volatile __ETHSTATbits_t ETHSTATbits __asm__ ("ETHSTAT") __attribute__((section("sfrs"), address(0xBF8890E0)));
extern volatile uint32_t        ETHSTATCLR __attribute__((section("sfrs"),address(0xBF8890E4)));
extern volatile uint32_t        ETHSTATSET __attribute__((section("sfrs"),address(0xBF8890E8)));
extern volatile uint32_t        ETHSTATINV __attribute__((section("sfrs"),address(0xBF8890EC)));
#define ETHRXOVFLOW ETHRXOVFLOW
extern volatile uint32_t   ETHRXOVFLOW __attribute__((section("sfrs"), address(0xBF889100)));
typedef union {
  struct {
    uint32_t RXOVFLWCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXOVFLOWbits_t;
extern volatile __ETHRXOVFLOWbits_t ETHRXOVFLOWbits __asm__ ("ETHRXOVFLOW") __attribute__((section("sfrs"), address(0xBF889100)));
extern volatile uint32_t        ETHRXOVFLOWCLR __attribute__((section("sfrs"),address(0xBF889104)));
extern volatile uint32_t        ETHRXOVFLOWSET __attribute__((section("sfrs"),address(0xBF889108)));
extern volatile uint32_t        ETHRXOVFLOWINV __attribute__((section("sfrs"),address(0xBF88910C)));
#define ETHFRMTXOK ETHFRMTXOK
extern volatile uint32_t   ETHFRMTXOK __attribute__((section("sfrs"), address(0xBF889110)));
typedef union {
  struct {
    uint32_t FRMTXOKCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFRMTXOKbits_t;
